#ifndef _TM1624_FONT_H_
#define _TM1624_FONT_H_

#include "Arduino.h"

// 3x5 点阵数字字符（0-9）
const PROGMEM byte TM1624_NUMBER_FONT_3X5[10][5] = {
    {0b111, 0b101, 0b101, 0b101, 0b111}, // 0
    {0b010, 0b110, 0b010, 0b010, 0b111}, // 1
    {0b111, 0b001, 0b111, 0b100, 0b111}, // 2
    {0b111, 0b001, 0b111, 0b001, 0b111}, // 3
    {0b101, 0b101, 0b111, 0b001, 0b001}, // 4
    {0b111, 0b100, 0b111, 0b001, 0b111}, // 5
    {0b111, 0b100, 0b111, 0b101, 0b111}, // 6
    {0b111, 0b001, 0b001, 0b001, 0b001}, // 7
    {0b111, 0b101, 0b111, 0b101, 0b111}, // 8
    {0b111, 0b101, 0b111, 0b001, 0b111}  // 9
};

const PROGMEM byte TM1624_NUMBER_FONT_DOT[5] = {0, 1, 0, 1, 0}; // :


#endif